{
  "TITLE":"区块链量子随机数发生器",
  "TITLERNG":"区块链随机数发生器",
  "TOTAL":"累计已生成",
  "UNIT":"个",

  "TRY_IT_GROUP":"组 ",
  "TRY_MIN":"范围 ",
  "TRY_MAX":"到",
  "TRY_NUM":"数量 ",
  "TRY_REPEATABLE":"可重复",
  "TRY_ARRANGEMENT":"排列",
  "TRY_COMBINATION":"组合",
  "TRY_SUBMIT":"生成随机数",
  "TRY_RESULT":"结果",
  "TRY_DETAIL":"查看详情",

  "TRY_Integer":"您输入的不是整数，请输入整数！",
  "TRY_Beyond":"超出随机范围，请重新输入!",

  "TIME_TEXT":"时间塔",
  "TIME_INFORMATION1":"「时间塔」是一个区块链量子随机数发生器，以广播塔的形式为全球所有的大学及科研机构提供免费的、随时可用的、永不消亡的、量子级的真随机源，而这也是正是「时间塔」名字的由来。",
  "TIME_INFORMATION2":"「时间塔」所用的随机种子来源于 En-Tan-Mo 区块链的链上信息，通过串行计算、混沌映射、哈希碰撞、延时叠加等一系列设计，使得最终随机序列不能被单个输入参数改变，从而得到一个均匀分布、不可篡改、大众可以参与验证的量子随机数发生器。",

  "RANDOM_TEXT":"量子通信中的随机数",
  "RANDOM_INFORMATION1":"在量子通信中，量子密钥分发是量子密码学的核心，其无条件安全性是由量子力学的防窃听信道和一次一密系统两方面保证的，一次一密系统要求永不重复使用密码本，即要求真随机码序列。在实际量子密钥分发系统中，量子密钥在本质上是从随机码序列中提取出来的，收发双方需要使用这个随机码来制备和随机检测单光子的量子态，为了使探测结果不相关，这个随机码必须是真随机的，并且不能重复，即在量子密钥分发中只有使用真随机数才能保证密钥的无条件安全性。因此，研发超高速的高性能随机数发生器已经成为世界各国科研工作者关注的课题之一。",
  "RANDOM_INFORMATION2":"",

  "QRNG_TEXT":"量子随机数发生器",
  "QRNG_INFORMATION1":"量子随机数发生器利用了微观世界中大量量子活动的不确定来产生随机数，具有真正的不确定性，而且量子数量巨大，能够产生吉比特级别的随机数，可以为量子密钥分发提供可靠的随机数来源，是当前随机数产生器研究的热点方向。但是，微观量子过于微小，对其进行观测需要高精密的仪器，代价巨大，而且在测量过程中引入的噪声也会干扰量子的行为，导致结果不是真正的随机。",
  "QRNG_INFORMATION2":"在宏观世界中，如果从宇宙的视角来看，人类也只是一个个量子而已，人类的行为由个体的自由意志控制，不受物理定律的控制。因此，人类的行为也是具有真随机性的，大量人类行为的结果，可以作为真随机源使用。区块链作为一种以用户共识为基础的应用，是大量用户自由交易的结晶，天然就具有随机性，而且区块链数据具有不可篡改的特性，所有数据都记录在链上，可供用户来检验。区块数据是以大量用户交易来产生的，个人行为尚不可完全预测，大量用户的交易行为就更不可预测了，因此区块链数据可以看作是宏观世界的量子随机源。",

  "WHY_TEXT":"为什么是 En-Tan-Mo",
  "WHY_INFORMATION1":"En-Tan-Mo 区块链可以实现 3 秒出块，这就保证了时间塔能够每 3 秒输出一个随机种子，这个随机种子由 En-Tan-Mo 参与并共同生成。有了 En-Tan-Mo 开源的量子级混沌算法的加持，每一个参与者都会对随机数产生一定的影响力，从而保证任何人都无法控制或者预测该随机数。「时间塔」之所以会从世界上万条的区块链公链中选择 En-Tan-Mo 作为共同参与者，是因为无论从技术实力，还是理念价值角度而言，En-Tan-Mo 都是「时间塔」最正确也最合适的选择。未来，随着 En-Tan-Mo 区块链侧链应用的开展，En-Tan-Mo 区块链随机种子数据将以指数级别增长，达到吉比特级别的随机数产生速度，从而为量子通信中的密钥系统提供丰富的随机数来源。",
  "WHY_INFORMATION2":"",

  "FREE_TEXT":"免费提供给大学及科研机构使用",
  "FREE_INFORMATION1":"科学研究需要广泛传播和有效利用，致力于推进区块链技术发展的 En-Tan-Mo 科学家团队在创立之初，就秉承着「源于大众、归于大众」的理念，这与「时间塔」的价值观不谋而合。由于区块链量子随机数发生器在科学研究中有着重大的意义与广泛的实际应用场景，作为相关领域的研究与实践者，「时间塔」团队决定，将这一区块链量子随机数发生器免费提供给大学及科研机构使用。",
  "FREE_INFORMATION2":"任何大学及科研机构，只需通过简单的申请流程，就能直接使用这一随机源，无需再进行复杂而昂贵的基础建设。",

  "API_TEXT":"",
  "API_INFORMATION1":"为了让科研人员可以很方便的调用「时间塔」提供的能力，我们提供了很多 API 供科研人员使用。参考 API 文档，通过简单参数修改，科研人员能够定制随机数的输出规格与频率。同时「时间塔」作为 En-Tan-Mo 的一个独立侧链应用，生成的所有随机数在链上均有记录，保障所有数据可信、可靠、可查。",
  "API_INFORMATION2":"*API 相关功能仅供科研使用，且暂未开放，将与 En-Tan-Mo 主网同步上线。",


  "DETAILS_TITLE01":"随机详情",
  "DETAILS_RESULT":"结果",
  "DETAILS_GROUP":"组 ",
  "DETAILS_MIN":"范围 ",
  "DETAILS_TYPE":"类型",
  "DETAILS_NUM":"数量 ",
  "DETAILS_QRN":"量子随机数 Q",
  "DETAILS_SOURCE":"生成 Q 值的相对应区块信息",
  "DETAILS_TITLE02":"验证结果",
  "DETAILS_PLACEHODE":"请输入 index",
  "DETAILS_HEAD":"结果"


}
