{
  "TITLE":"ブロックチェーン量子ランダマイザー",
  "TITLERNG":"ブロックチェーンランダマイザー",
  "TOTAL":"累積生成",
  "UNIT":"",

  "TRY_IT_GROUP":"グループ ",
  "TRY_MIN":"範囲 ",
  "TRY_MAX":"に",
  "TRY_NUM":"数 ",
  "TRY_REPEATABLE":"繰り返し可能",
  "TRY_ARRANGEMENT":"整理して",
  "TRY_COMBINATION":"組み合わせ",
  "TRY_SUBMIT":"乱数を生成する",
  "TRY_RESULT":"結果",
  "TRY_DETAIL":"詳細を見る",

  "TRY_Integer":"整数を入力していません。整数を入力してください。",
  "TRY_Beyond":"ランダムな範囲を超えて、再入力してください。",

  "TIME_TEXT":"タイムタワー",
  "TIME_INFORMATION1":"「タイムタワー」はブロックチェーン量子ランダマイザーである。放送タワーの形で全世界のあらゆる大学及び科学研究機関に無料、いつでも利用できる、いつまでも消えない、量子級的な真のランダムソースを提供する。これも「タイムタワー」という名の由来である。",
  "TIME_INFORMATION2":"「タイムタワー」で使われているランダムシードはEn-Tan-Moブロックチェーンのチェーン情報に由来する。シリアル計算、混沌写像、ハーシー衝突、延時重ねなど一連のデザインを通して、最終的ランダム序列は単一の入力パラメーターに変更されてはならないことによって、分布が均衡し、改竄できなく、一般の人々も検証に参与できる量子ランダマイザーを作成する。",

  "RANDOM_TEXT":"量子通信におけるランダム数",
  "RANDOM_INFORMATION1":"量子通信において、量子パスワードキーは量子暗号理論の核心である。その無条件の安全性は量子力学の盗聴防止チャネルと一次一つのパスワードシステムというような両方面から保証される。一次一つのパスワードシステムはコードブックを重ねる使うことをしてはならないことを要求する。すなわち、真ランダムコード序列を要求する。実際の量子パスワードキー配布システムにおいて、量子パスワードキーは本質的にはランダムな序列から引き取るもので、送受信の双方はこのランダムなコードを使って、単光子の量子態を作り出し、随時チェックする必要がある。探測の結果にかかわらないために、このランダムなコードは真のランダムでなければならない。そのうえ、重ねられてはならないことである。すなわち、量子パスワードキー配布の中で、真のランダム数だけを使うことによって、パスワードキーの安全性を保証することができる。したがって、超高速的及び高性能的のランダマイザーを研究開発することはもう世界各国の科学研究者が注目する課題になる。",
  "RANDOM_INFORMATION2":"",

  "QRNG_TEXT":"量子ランダマイザー",
  "QRNG_INFORMATION1":"量子ランダマイザーはミクロ世界の大量の量子活動の不確定を利用して、ランダム数を生成し、真の不確定性を有する。しかも、量子の数量が巨大から、ギガビットレベルのランダム数を生成できるし、量子パスワードキーの配布を信頼できるランダム数を提供できる。これは現在のランダマイザーを研究するホット方向である。しかし、ミクロ量子はきわめて小さいから、これを観測すると、高精密の設備が必要であり、コストもたかい。また、観測する過程で、雑音を引き入れると、量子の行いが防げられ、観測の結果は真のランダムではないことに招く。",
  "QRNG_INFORMATION2":"マクロ世界において、宇宙の視角から見ると、人類もただ一個一個の量子であり、人類の行いは個体の自由意志によってコントロールされ、物理定律にコントロールされない。したがって、人類の行いも真のランダム性があり、大量の人類の行為の結果は真のランダムな源として利用できる。ブロックチェーンは利用者の共通認識に基づく応用であり、大量の利用者が自由で引き取る結晶でありから、ランダム性を持っている。しかも、ブロックチェーンのデータが改竄できない特性を持って、あらゆるデータはチェーンに記録され、利用者はチェックすることができる。ブロックチェーンは大量の利用者の引き取る行為によって生成するから、個人的な行為はまだ完全に予測できなく、大量の利用者の引き取る行為も更に予測できなくなる。だから、ブロックチェーンはマクロ世界の量子のランダムの源と見なすことができる。",

  "WHY_TEXT":"なぜEn-Tan-Moであるか",
  "WHY_INFORMATION1":"En-Tan-Moブロックチェーンは3秒でブロックを作ることができるから、これはタイムタワーも3秒で一つのランダムなシードを作ることが保証できる。このランダムなシードはEn-Tan-Moが参与し共同生成するものである。En-Tan-Mo開源的量子級混沌算法の加持があると、参与者もランダム数に一定の影響を与え、結果として、誰でもこのランダム数をコントロール、あるいは予測できないことが保証される。「タイムタワー」は世界中の何万条のブロックチェーンの中からEn-Tan-Moを共同参与者として選ぶ理由は、技術の実力からみても、理念の価値からみてもEn-Tan-Moは「タイムタワー」の最も正確的、適切な選択ものである。未来、En-Tan-Moブロックチェーン応用の展開を伴い、En-Tan-Moブロックチェーンランダムなシードのデータは指数級別で増やし、ギガビット級別のランダム数を生成するスピードに達し、量子通信のパスワードキーシステムに豊富なランダム数の来源を提供することになる。",
  "WHY_INFORMATION2":"",

  "FREE_TEXT":"大学と科学研究機関に無料で提供する",
  "FREE_INFORMATION1":"科学研究は広い伝播と有効利用が必要で、ブロックチェーン技術の発展に力を尽くすEn-Tan-Mo 科学家チームは、結成はじめにおいて、「大衆に由来、大衆に復帰」の理念を持った。これは「タイムタワー」の価値観と一致する。ブロックチェーン量子ランダマイザーは科学研究の中で重大な意義と広く実際的な応用場面を持っているから、関連領域の研究者と実践者、「タイムタワー」チームは、このブロックチェーン量子ランダマイザーを大学と科学研究機関に無料で提供することを決める。",
  "FREE_INFORMATION2":"すべての大学と科学研究機関には、簡単な申し込む手続きによって、直接にこれを使え、再び複雑及び高い基礎建設を使う必要はない。",

  "API_TEXT":"",
  "API_INFORMATION1":"科学研究者は便利で「タイムタワー」が提供する能力を使うために、私たちはたくさんのAPIを提供し、科学研究者はこれを利用できる。APIドキュメントに参考し、簡単なパラメータを修正し、科学研究者はランダム数の輸出の規格と頻率を作ることが出来る。同時に、「タイムタワー」はEn-Tan-Moの一つの独立側チェーンの応用として、生成したすべてのランダム数はチェーンで記録があり、あらゆるデータは信頼でき、真実で、チェックできることを保障する。",
  "API_INFORMATION2":"*API 関連の機能は科学研究しか利用しない。いまはまだ公開しなく、En-Tan-Mo のメインネットとともに利用できること。",

  "DETAILS_TITLE01":"ランダムな詳細",
  "DETAILS_RESULT":"結果",
  "DETAILS_GROUP":"グループ ",
  "DETAILS_MIN":"範囲 ",
  "DETAILS_TYPE":"タイプ",
  "DETAILS_NUM":"数量 ",
  "DETAILS_QRN":"量子乱数 Q",
  "DETAILS_SOURCE":"Q 値に対応するブロック情報を生成",
  "DETAILS_TITLE02":"検証結果",
  "DETAILS_PLACEHODE":"index 入力してください ",
  "DETAILS_HEAD":"結果"

}
