{
  "TITLE":"區塊鏈量子亂數發生器",
  "TITLERNG":"區塊鏈亂數發生器",
  "TOTAL":"累計已生成",
  "UNIT":"個",

  "TRY_IT_GROUP":"組 ",
  "TRY_MIN":"範圍 ",
  "TRY_MAX":"到",
  "TRY_NUM":"數量 ",
  "TRY_REPEATABLE":"可重複",
  "TRY_ARRANGEMENT":"排列",
  "TRY_COMBINATION":"組合",
  "TRY_SUBMIT":"生成隨機數",
  "TRY_RESULT":"結果",
  "TRY_DETAIL":"查看詳情",


  "TRY_Integer":"您輸入的不是整數，請輸入整數！",
  "TRY_Beyond":"超出隨機範圍，請重新輸入!",

  "TIME_TEXT":"時間塔",
  "TIME_INFORMATION1":"「時間塔」是一個區塊鏈量子亂數發生器，以廣播塔的形式為全球所有的大學及科研機構提供免費的、隨時可用的、永不消亡的、量子級的真隨機源，而這也是正是「時間塔」名字的由來。",
  "TIME_INFORMATION2":"「時間塔」所用的隨機種子來源於 En-Tan-Mo 區塊鏈的鏈上資訊，通過串行計算、混沌映射、哈希碰撞、延時疊加等一系列設計，使得最終隨機序列不能被單個輸入參數改變，從而得到一個均勻分佈、不可篡改、大眾可以參與驗證的量子亂數發生器。",

  "RANDOM_TEXT":"量子通信中的亂數",
  "RANDOM_INFORMATION1":"在量子通信中，量子密鑰分發是量子密碼學的核心，其無條件安全性是由量子力學的防竊聽通道和一次一密系統兩方面保證的，一次一密系統要求永不重複使用密碼本，即要求真隨機碼序列。在實際量子密鑰分發系統中，量子密鑰在本質上是從隨機碼序列中提取出來的，收發雙方需要使用這個隨機碼來製備和隨機檢測單光子的量子態，為了使探測結果不相關，這個隨機碼必須是真隨機的，並且不能重複，即在量子密鑰分發中只有使用真亂數才能保證密鑰的無條件安全性。因此，研發超高速的高性能亂數發生器已經成為世界各國科研工作者關注的課題之一。",
  "RANDOM_INFORMATION2":"",

  "QRNG_TEXT":"量子亂數發生器",
  "QRNG_INFORMATION1":"量子亂數發生器利用了微觀世界中大量量子活動的不確定來產生亂數，具有真正的不確定性，而且量子數量巨大，能夠產生吉比特級別的亂數，可以為量子密鑰分發提供可靠的亂數來源，是當前亂數產生器研究的熱點方向。但是，微觀量子過於微小，對其進行觀測需要高精密的儀器，代價巨大，而且在測量過程中引入的雜訊也會干擾量子的行為，導致結果不是真正的隨機。",
  "QRNG_INFORMATION2":"在宏觀世界中，如果從宇宙的視角來看，人類也只是一個個量子而已，人類的行為由個體的自由意志控制，不受物理定律的控制。因此，人類的行為也是具有真隨機性的，大量人類行為的結果，可以作為真隨機源使用。區塊鏈作為一種以用戶共識為基礎的應用，是大量用戶自由交易的結晶，天然就具有隨機性，而且區塊鏈數據具有不可篡改的特性，所有數據都記錄在鏈上，可供用戶來檢驗。區塊數據是以大量用戶交易來產生的，個人行為尚不可完全預測，大量用戶的交易行為就更不可預測了，因此區塊鏈數據可以看作是宏觀世界的量子隨機源。",

  "WHY_TEXT":"為什麼是 En-Tan-Mo",
  "WHY_INFORMATION1":"En-Tan-Mo 區塊鏈可以實現 3 秒出塊，這就保證了時間塔能夠每 3 秒輸出一個隨機種子，這個隨機種子由 En-Tan-Mo 參與並共同生成。有了En-Tan-Mo 開源的量子級混沌演算法的加持，每一個參與者都會對亂數產生一定的影響力，從而保證任何人都無法控制或者預測該亂數。「時間塔」之所以會從世界上萬條的區塊鏈公鏈中選擇 En-Tan-Mo 作為共同參與者，是因為無論從技術實力，還是理念價值角度而言，En-Tan-Mo 都是「時間塔」最正確也最合適的選擇。未來，隨著 En-Tan-Mo 區塊鏈側鏈應用的開展，En-Tan-Mo 區塊鏈隨機種子數據將以指數級別增長，達到吉比特級別的亂數產生速度，從而為量子通信中的密鑰系統提供豐富的亂數來源。",
  "WHY_INFORMATION2":"",

  "FREE_TEXT":"免費提供給大學及科研機構使用",
  "FREE_INFORMATION1":"科學研究需要廣泛傳播和有效利用，致力於推進區塊鏈技術發展的 En-Tan-Mo 科學家團隊在創立之初，就秉承著「源於大眾、歸於大眾」的理念，這與「時間塔」的價值觀不謀而合。由於區塊鏈量子亂數發生器在科學研究中有著重大的意義與廣泛的實際應用場景，作為相關領域的研究與實踐者，「時間塔」團隊決定，將這一區塊鏈量子亂數發生器免費提供給大學及科研機構使用。",
  "FREE_INFORMATION2":"任何大學及科研機構，只需通過簡單的申請流程，就能直接使用這一隨機源，無需再進行複雜而昂貴的基礎建設。",

  "API_TEXT":"",
  "API_INFORMATION1":"為了讓科研人員可以很方便的調用「時間塔」提供的能力，我們提供了很多 API 供科研人員使用。參考 API 文檔，通過簡單參數修改，科研人員能夠定制亂數的輸出規格與頻率。同時「時間塔」作為 En-Tan-Mo 的一個獨立側鏈應用，生成的所有亂數在鏈上均有記錄，保障所有數據可信、可靠、可查。",
  "API_INFORMATION2":"*API 相關功能僅供科研使用，且暫未開放，將與 En-Tan-Mo 主網同步上線。",

  "DETAILS_TITLE01":"隨機詳情",
  "DETAILS_RESULT":"結果",
  "DETAILS_GROUP":"組 ",
  "DETAILS_MIN":"範圍 ",
  "DETAILS_TYPE":"類型",
  "DETAILS_NUM":"數量 ",
  "DETAILS_QRN":"量子隨機數 Q",
  "DETAILS_SOURCE":"生成 Q 值的相對應區塊信息",
  "DETAILS_TITLE02":"驗證結果",
  "DETAILS_PLACEHODE":"請輸入 index",
  "DETAILS_HEAD":"結果"

}
